Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: On each active edge, the state sampled from the DIR input determines whether to step forward or back.
it_it: A ogni fronte attivo, lo stato campionato dall'ingresso DIR determina se avanzare o retrocedere.

source: On the TMC2209 and TMC2226 the smartEnergy stall velocity is the TCOOLTHRS register.
it_it: Sui TMC2209 e TMC2226, la velocità di stallo di smartEnergy è il registro TCOOLTHRS.

source: Once a stall is detected, the ramp generator stops motion and sets VACTUAL zero, stopping the motor.
it_it: Una volta rilevato uno stallo, il generatore di rampa arresta il movimento e imposta VACTUAL a zero, arrestando il motore.

source: Once the HOST RTS is in-active, the decoder issues a NAK message, which causes the host to re-try the entire message.
it_it: Una volta che l'RTS dell'HOST è inattivo, il decoder emette un messaggio NAK, che induce l'host a ritentare l'intero messaggio.

source: Once the motor runs, you may decide to explore additional features, e.g., freewheeling and further functionality in more detail.
it_it: Una volta avviato il motore, si può decidere di esplorare funzionalità aggiuntive, ad esempio il "freewheeling" [ruota liberao in folle" e altre funzionalità in modo più dettagliato.

source: Once the number of characters indicated by the host is received (plus the two bytes required for a checksum), further characters are ignored.
it_it: Una volta ricevuto il numero di caratteri indicato dall'host (più i due byte necessari per un checksum), i caratteri successivi vengono ignorati.

source: One basic limitation is the usable velocity range: at zero velocity, the motor efficiency is zero, because it cannot deliver mechanical energy to the application, despite that standstill torque is required in many applications.
it_it: Una limitazione fondamentale è l'intervallo di velocità utilizzabile: a velocità zero, l'efficienza del motore è pari a zero, poiché non può fornire energia meccanica all'applicazione, nonostante la coppia di arresto sia richiesta in molte applicazioni.

source: One periodically drives through the whole range of mechanical load.
it_it: Si guida periodicamente attraverso l'intero intervallo di carico meccanico.

source: Only after multiple failure attempts spread over some period of time should the host declare the interface 'non-viable'.
it_it: Solo dopo diversi tentativi falliti distribuiti in un certo periodo di tempo, l'host dovrebbe dichiarare l'interfaccia 'non valida'.

source: Only one message per HOST RTS/CTS handshake is recognized, so if the host sends two (or more) messages without changing the state of the HOST RTS line, the decoder ignores the second (and subsequent) messages.
it_it: Viene riconosciuto un solo messaggio per handshake HOST RTS/CTS, quindi se l'host invia due (o più) messaggi senza modificare lo stato della linea HOST RTS, il decoder ignora il secondo (e i successivi) messaggio.

source: Opcode
it_it: Codice Operativo

source: Open the TMCL IDE and connect it to the TMC5130 eval kit with USB.
it_it: Aprire l'IDE TMCL e collegarlo al kit di valutazione TMC5130 tramite USB.

source: Operate the motor at low velocity < 10 RPM (a few to a few ten fullsteps per second) and target operation current and supply voltage.
it_it: Fare funzionare il motore a bassa velocità < 10 giri/min (da pochi a poche decine di passi completi al secondo) e impostare la corrente di funzionamento e la tensione di alimentazione desiderate.

source: Operate the motor at the normal operation velocity for your application and monitor SG_RESULT.
it_it: Azionare il motore alla normale velocità di funzionamento per l'applicazione e monitorare SG_RESULT.

source: Operation with an external motion controller often requires quick reaction to certain states of the stepper motor driver.
it_it: Il funzionamento con un controller di movimento esterno spesso richiede una reazione rapida a determinati stati del driver del motore passo-passo.

source: Option 3 is similar to Option 2, except there is a programmable inter-packet delay.
it_it: L'Opzione 3 è simile all'Opzione 2, tranne per il fatto che prevede un ritardo inter-pacchetto programmabile.

source: Other IC’s, like the TMC2130 and TMC2160, use DIAG pins for this functionality.
it_it: Altri circuiti integrati, come il TMC2130 e il TMC2160, utilizzano i pin DIAG per questa funzionalità.

source: Other conditions will also lead to extreme settings of SGT and poor response of the measurement value SG_RESULT to the motor load.
it_it: Anche altre condizioni porteranno a impostazioni estreme di SGT e a una scarsa risposta del valore di misurazione SG_RESULT al carico del motore.

source: Otherwise it sends CMD_NAK, host directive denied.
it_it: In caso contrario, invia CMD_NAK, la direttiva host viene negata.

source: Otherwise, it would operate as a generator and will lead to an increase in the StallGuard2 signal with increasing load.
it_it: Altrimenti, funzionerebbe come un generatore e porterebbe a un aumento del segnale di StallGuard2 con l'aumentare del carico.

source: Outside this range, a stall may not be detected safely, and CoolStep might not give the optimum result.
it_it: Al di fuori di questo intervallo, lo stallo potrebbe non essere rilevato in modo sicuro e CoolStep potrebbe non fornire il risultato ottimale.

source: PROGRAMMER’S GUIDE
it_it: GUIDA ALLA PROGRAMMAZIONE

source: Packet Format
it_it: Formato del Pacchetto

source: Page
it_it: Pagina

source: Parameter
it_it: Parametro

source: Parameterization of StallGuard2
it_it: Parametrizzazione di StallGuard2

source: Parameterization of StallGuard2™ & CoolStep™
it_it: Parametrizzazione di StallGuard2™ & CoolStep™

source: Parameterization of StallGuard4
it_it: Parametrizzazione di StallGuard2

source: Parameterizing CoolStep
it_it: Parametrizzazione di CoolStep

source: Permits bar code scanning.
it_it: Consente la scansione dei codici a barre.

source: Please be aware, that disabling the driver via ENN will require three clock cycles to safely switch off the driver.
it_it: Si tenga presente che la disabilitazione del driver tramite ENN richiederà tre cicli di clock per spegnere il driver in sicurezza.

source: Please refer to our web page http://www.trinamic.com .
it_it: Si prega di fare riferimento alla pagina web http://www.trinamic.com .

source: Please refer to the IC’s datasheet to tune StealthChop.
it_it: Per la messa a punto di StealthChop, fare riferimento al datasheet del circuito integrato.

source: Please refer to the TMC5130A evaluation board to allow a quick start with the device, and in order to allow interactive tuning of the device setup in your application.
it_it: Fare riferimento alla scheda di valutazione TMC5130A per consentire un avvio rapido con il dispositivo e per consentire la regolazione interattiva della configurazione del dispositivo nella propria applicazione.

source: Please see the StealthChop application note to learn more on how it works.
it_it: Consultare la nota applicativa di StealthChop per saperne di più sul suo funzionamento.

source: Plots of StallGuard2 Value SG for Different SGT Values
it_it: Grafici del valore SG di StallGuard2 per diversi valori SGT

source: Positive acknowledgment of received packet.
it_it: Conferma positiva del pacchetto ricevuto.

source: Prevents the operator from scanning bar codes.
it_it: Impedisce all'operatore di scansionare i codici a barre.

source: Proceed as follow:
it_it: Procedere come segue:

source: Proceed as follows:
it_it: Procedere come segue:

source: Programmable microstep shapes allow optimizing the motor performance for low-cost motors.
it_it: I profili di microstep programmabili consentono di ottimizzare le prestazioni del motore per motori a basso costo.

source: Programmable upper and lower limits of CoolStep are provided for handling the dependency of the StallGuard2 value SG from the current amplitude.
it_it: Sono previsti limiti superiore e inferiore programmabili per CoolStep per gestire la dipendenza del valore SG di StallGuard2 dall'ampiezza della corrente.

source: Protocol layers are described in a “bottom-up” manner, from the hardware layer up through software handshaking.
it_it: I layer del protocollo sono descritti in modo "bottom-up", dal layer hardware fino a quello dell'handshaking software.

source: Quarter current also fits with many applications that are compatible with CoolStep, but parameterization might be more challenging.
it_it: Anche un quarto di corrente è adatto a molte applicazioni compatibili con CoolStep, ma la parametrizzazione potrebbe essere più complessa.

source: Quarter current results in 6.25% power dissipation.
it_it: Un quarto di corrente comporta una dissipazione di potenza del 6,25%.

source: Quick Start
it_it: Avvio Rapido

source: RSM command to read/set some scanner attributes.
it_it: Comando RSM per leggere/impostare alcuni attributi dello scanner.

source: RTS: Drives host CTS, Decoder Output.
it_it: RTS: Pilota il CTS dell'host, l'Output del Decoder.

source: RXD: Serial data receive input.
it_it: RXD: Input di ricezione dati seriali..

source: Ramp Generator Motion Control Register Set
it_it: Set di Registri per il Controllo del Movimento del Generatore di Rampa

source: Raw decode data and the WAKEUP command do not use ACK/NAK handshaking since they are not packeted data.
it_it: I dati di decodifica grezzi e il comando WAKEUP non utilizzano l'handshake ACK/NAK poiché non sono dati inpacchettati.

source: Read data is transferred back to the master with the subsequent read or write access.
it_it: I dati letti vengono trasferiti nuovamente al master con il successivo accesso in lettura o scrittura.

source: Read only
it_it: Sola lettura

source: Read- and writable register
it_it: Registro di lettura e scrittura

source: Red one is the actual motor current versus time, while the blue one is the stall guard value versus time.
it_it: Quello rosso rappresenta la corrente effettiva del motore in funzione del tempo, mentre quello blu rappresenta il valore di stall guard in funzione del tempo.

source: Reduce again to the highest value, where SG_RESULT stays at 0.
it_it: Ridurre nuovamente al valore più alto, in cui SG_RESULT rimane a 0.

source: Reducing motor current by half results in reducing power by a factor of four.
it_it: Ridurre la corrente del motore della metà si traduce in una riduzione della potenza di un fattore quattro.

source: Reducing power consumption keeps the system cooler, increases motor life, and allows reducing cost in the power supply and cooling components.
it_it: Ridurre il consumo energetico mantiene il sistema più "fresco", aumenta la durata del motore e consente di ridurre i costi di alimentazione e dei componenti di raffreddamento.

source: Refer to the Product Reference Guide for your product for product-specific information on SSI.
it_it: Consultare la Guida di Riferimento del Prodotto per informazioni specifiche sul prodotto in uso su SSI.

source: References
it_it: Riferimenti

source: Related Documents
it_it: Documenti Correlati

source: Replies to REQUEST_REVISION with decoder's software/hardware configuration.
it_it: Risponde a REQUEST_REVISION con la configurazione software/hardware del decoder.

source: Requests commands which decoder will perform.
it_it: Richiede i comandi che il decoder eseguirà.

source: Requests stored decode data.
it_it: Richiede i dati di decodifica memorizzati.

source: Requests the decoder's configuration.
it_it: Richiede la configurazione del decoder.

source: Requests the decoder’s serial capabilities.
it_it: Richiede le capacità seriali del decoder.

source: Requests to place the decoder into low power.
it_it: Richiede di mettere il decoder in modalità basso consumo.

source: Requests values of certain parameters.
it_it: Richiede i valori di determinati parametri.

source: Reserved
it_it: Riservato

source: Resistive losses within the coil (P = 2 * R * I COIL ²) add an offset.
it_it: Le perdite resistive all'interno della bobina (P = 2 * R * I COIL ²) aggiungono un offset.

source: Restart the motor by disabling sg_stop or by reading the RAMP_STAT register (read and clear function).
it_it: Riavviare il motore disabilitando sg_stop o leggendo il registro RAMP_STAT (funzione di lettura e cancellazione).

source: Retransmit
it_it: Ritrasmetti

source: Revision History
it_it: Revisioni

source: Right now we can see that the run current is at 1.01A.
it_it: Ora possiamo vedere che la corrente di funzionamento è di 1,01 A.

source: Run motor #1 a number of micro steps to apply a load.
it_it: Far girare il motore n. 1 per un certo numero di micropassi per applicare un carico.

source: SCK – bus clock input
it_it: SCK – ingresso clock bus

source: SDI – serial data input
it_it: SDI – ingresso dati seriali

source: SDO – serial data output
it_it: SDO – uscita dati seriali

source: SFILT Switch – Optional Filtering of StallGuard2 Values
it_it: SFILT Switch – Filtraggio opzionale dei valori StallGuard2

source: SGT ranges from -64…+63.
it_it: SGT varia da -64 a +63.

source: SG_RESULT is the StallGuard value.
it_it: SG_RESULT è il valore di StallGuard.

source: SIMPLE SERIAL INTERFACE PROGRAMMER’S GUIDE
it_it: SIMPLE SERIAL INTERFACE GUIDA ALLA PROGRAMMAZIONE

source: SPI datagram example sequence to enable the driver for step and direction operation and initialize the chopper for SpreadCycle operation and for StealthChop at <30 RPM:
it_it: Sequenza di esempio del datagramma SPI per abilitare il driver per il funzionamento a passi e direzione e inizializzare il chopper per il funzionamento SpreadCycle e per StealthChop a <30 RPM:

source: SPI interface timing
it_it: Temporizzazione dell'interfaccia SPI

source: SPI sample sequence to enable and initialize the motion controller and move one rotation (51200 microsteps) using the ramp generator.
it_it: Sequenza di esempio SPI per abilitare e inizializzare il controller di movimento e muoverlo di una rotazione (51200 microstep) utilizzando il generatore di rampa.

source: SSI Command Lists
it_it: Liste dei Comandi SSI

source: SSI supports multiple packets for one message for cases when size is insufficient to transfer a complete message.
it_it: SSI supporta più pacchetti per un messaggio nei casi in cui le dimensioni non siano sufficienti per trasferire un messaggio completo.

source: SSI_MGMT_COMMAND or CMD_NAK
it_it: SSI_MGMT_COMMAND o CMD_NAK

source: STOCK.2 technology prevents step loss keeping step current integrity by stopping the motor when the set load value is used.
it_it: La tecnologia StallGuard2 previene la perdita di passo mantenendo l'integrità della corrente di passo arrestando il motore quando viene raggiunto il valore di carico impostato.

source: Search SGT within the range -10 … +10, starting with SGT = 0
it_it: Cercare SGT nell'intervallo -10 … +10, iniziando con SGT = 0.

source: Second case (b):
it_it: Secondo caso (b):

source: Section 2.5.1.3 goes over this in more detail.
it_it: La Sezione 2.5.1.3 illustra questo aspetto in modo più dettagliato.

source: See Multipacketing on page 1-9 for multi-packeting options.
it_it: Consultare Multipacketing a pagina 1-9 per le opzioni di multipacketing.

source: See SSI Command Lists on page 2-1.
it_it: Consultare la Lista dei Comandi SSI a pagina 2-1.

source: See individual sections for details.
it_it: Vedere le singole sezioni per i dettagli.

source: Select SGT that you get StallGuard2 values of 0 with mechanical load close before stall.
it_it: Selezionare SGT in modo da ottenere valori StallGuard2 pari a 0 con carico meccanico prossimo allo stallo.

source: Select SGT that you get StallGuard2 values of some 100 in case without load.
it_it: Selezionare SGT in modo da ottenere valori StallGuard2 pari a circa 100 in assenza di carico.

source: Select SGT value close to zero (if possible).
it_it: Selezionare un valore SGT vicino allo zero (se possibile).

source: Select SGT value from center of valid range.
it_it: Selezionare un valore SGT al centro dell'intervallo valido.

source: Select SGT values almost independent from current (if possible).
it_it: Selezionare valori SGT quasi indipendenti dalla corrente (se possibile).

source: Select SGT values with maximum SG value without mechanical load.
it_it: Selezionare valori SGT con valore SG massimo senza carico meccanico.

source: Select one SGT value out of a set of valid SGT values.
it_it: Selezionare un valore SGT da un insieme di valori SGT validi.

source: Selection of the actual interface is done via the configuration pin SW_SEL, which can be hardwired to GND or VCC_IO depending on the desired interface.
it_it: La selezione dell'interfaccia effettiva avviene tramite il pin di configurazione SW_SEL, che può essere cablato a GND o VCC_IO a seconda dell'interfaccia desiderata.

source: Sends parameter values.
it_it: Invia i valori dei parametri.

source: Sensorless stall detection and mechanical load measurement.
it_it: Rilevamento dello stallo senza sensori e misurazione del carico meccanico.

source: Serial Parameter Settings
it_it: Impostazioni dei Parametri Seriali

source: Service Information
it_it: Informazioni sull'Assistenza

source: Set TCOOLTHRS to match the lower velocity threshold where StallGuard delivers a good result in order to use sg_stop.
it_it: Impostare TCOOLTHRS in modo che corrisponda alla soglia di velocità inferiore alla quale StallGuard fornisce un buon risultato per utilizzare sg_stop.

source: Set GCONF flag stop_enable to activate this option.
it_it: Impostare il flag GCONF stop_enable per attivare questa opzione.

source: Set TCOOLTHS to match the lower velocity limit for StallGuard operation.
it_it: Impostare TCOOLTHS in modo che corrisponda al limite di velocità inferiore per il funzionamento di StallGuard.

source: Set maximum supply voltage (this will be explained later).
it_it: Impostare la tensione di alimentazione massima (questo verrà spiegato più avanti).

source: Sets parameter default values.
it_it: Imposta i valori di default dei parametri.

source: Sets the current increment step.
it_it: Imposta il passo di incremento corrente.

source: Sets the lower motor current limit for CoolStep operation by scaling the IRUN current setting.
it_it: Imposta il limite inferiore della corrente del motore per il funzionamento CoolStep scalando l'impostazione della corrente IRUN.

source: Sets the number of StallGuard2 readings above the upper threshold necessary for each current decrement of the motor current.
it_it: Imposta il numero di letture StallGuard2 al di sopra della soglia superiore necessaria per ogni decremento di corrente del motore corrente.

source: Setting
it_it: Impostazione

source: Settings for other parameters related to image capture, video capture and other decoder performances should also be reviewed before using SSI.
it_it: Prima di utilizzare SSI, è necessario rivedere anche le impostazioni di altri parametri relativi all'acquisizione di immagini, all'acquisizione video e ad altre prestazioni del decoder.

source: Several additional factors influence the required voltage level to drive the motor at the target current: The motor resistance, its back EMF (directly proportional to its velocity) as well as actual level of the supply voltage.
it_it: Diversi fattori aggiuntivi influenzano il livello di tensione richiesto per pilotare il motore alla corrente target: la resistenza del motore, la sua forza controelettromotrice (direttamente proporzionale alla sua velocità) e il livello effettivo della tensione di alimentazione.

source: Shipping the units improperly can possibly void the warranty.
it_it: La spedizione impropria delle unità può invalidare la garanzia.

source: Simple Serial Interface Programmer’s Guide (en)
it_it: Simple Serial Interface - Guida alla Programmazione (it)

source: Since the decoder does not change the state of the HOST CTS line when transmitting, the host is aware of a decoder transmission only when it receives the first character.
it_it: Poiché il decoder non modifica lo stato della linea HOST CTS durante la trasmissione, l'host viene a conoscenza di una trasmissione del decoder solo quando riceve il primo carattere.

source: Since this mode does not measure the actual current, it will not respond to modification of the current setting, like stand still current reduction.
it_it: Poiché questa modalità non misura la corrente effettiva, non risponderà a modifiche dell'impostazione di corrente, come la riduzione della corrente di fermo.

source: So, 0x80 has to be added to the address for a write access.
it_it: Quindi, per un accesso in scrittura è necessario aggiungere 0x80 all'indirizzo.

source: So, motor #1 is always able to drive the load from motor #2 without stall but close to stall of motor #1.
it_it: Quindi, il motore #1 è sempre in grado di azionare il carico del motore #2 senza stallo, ma con una corrente prossima allo stallo del motore #1.

source: So, one can set them to 0.
it_it: Quindi, è possibile impostarli a 0.

source: So, the bit named W is a WRITE_notREAD control bit.
it_it: Quindi, il bit denominato W è un bit di controllo WRITE_notREAD.

source: So, the difference between a read and a write access is that the read access does not transfer data to the addressed register, but it transfers the address only and its 32 data bits are dummies, and, further the following read or write access delivers back the data read from the address transmitted in the preceding read cycle.
it_it: Quindi, la differenza tra un accesso in lettura e uno in scrittura è che l'accesso in lettura non trasferisce dati al registro indirizzato, ma trasferisce solo l'indirizzo e i suoi 32 bit di dati sono fittizi; inoltre, il successivo accesso in lettura o scrittura restituisce i dati letti dall'indirizzo trasmesso nel ciclo di lettura precedente.

source: So, the increasing of current is triggered if SG < (SEMIN * 32).
it_it: Quindi, l'aumento di corrente viene attivato se SG < (SEMIN * 32).

source: So, you should start with one of the fastest current increase rates (SEUP=11 or SEUP=10) and reduce the increase rate if necessary due to jerk.
it_it: Quindi, si consiglia di iniziare con una delle velocità di aumento della corrente più elevate (SEUP=11 o SEUP=10) e di ridurre la velocità di aumento se necessario a causa del jerk.

source: So, you should start with one of the lowest current decreasing rates (SEDN=00 or SEDN=01).
it_it: Quindi, si dovrebbe iniziare con una delle velocità di riduzione della corrente più basse (SEDN=00 o SEDN=01).

source: Software Handshaking
it_it: Handshaking del Software

source: Software handshaking provides an ACK/NAK response for commands that do not have a natural response.
it_it: L'handshake software fornisce una risposta ACK/NAK per i comandi che non hanno una risposta naturale.

source: Solutions are presented to apply mechanical load that is required for optimal adjustment of the StallGuard threshold value.
it_it: Vengono presentate soluzioni per applicare il carico meccanico necessario per una regolazione ottimale del valore di soglia di StallGuard.

source: Some applications may require the driver to be put into a state with active holding current or with a passive braking mode.
it_it: Alcune applicazioni potrebbero richiedere che il driver venga messo in uno stato con corrente di mantenimento attiva o con una modalità di frenatura passiva.

source: Some drivers, like the TMC262 or TMC2660, have a dedicated pin for the StallGuard output (i.e., SG_TST).
it_it: Alcuni driver, come il TMC262 o il TMC2660, hanno un pin dedicato per l'uscita StallGuard (ad esempio, SG_TST).

source: Some of the registers allow both read and write access.
it_it: Alcuni registri consentono sia l'accesso in lettura che in scrittura.
